export const monthChartData = {
  // columns: [
  //   '金额', '合同', '目标成本'
  // ],
  columns: [
    '金额',
    '合同',
    '目标成本',
    '预计收益',
    '完成产值',
    '实际成本',
    '综合收益',
    '业主计价金额',
    '业主批复金额'
  ],
  rows: [
    {
      金额: '',
      合同: 150,
      目标成本: -100,
      预计收益: 50,
      完成产值: 140,
      实际成本: -90,
      综合收益: 50,
      业主计价金额: 140,
      业主批复金额: 100
    }
  ]
}
export const yearChartData = {
  // columns: [
  //   '金额', '合同', '目标成本'
  // ],
  columns: [
    '金额',
    '合同',
    '目标成本',
    '预计收益',
    '完成产值',
    '实际成本',
    '综合收益',
    '业主计价金额',
    '业主批复金额'
  ],
  rows: [
    {
      金额: '',
      合同: 250,
      目标成本: -200,
      50: '',
      完成产值: 300,
      实际成本: -310,
      综合收益: -10,
      业主计价金额: 300,
      业主批复金额: 250
    }
  ]
}
export const overChartData = {
  // columns: [
  //   '金额', '合同', '目标成本'
  // ],
  columns: [
    '金额',
    '合同',
    '目标成本',
    '预计收益',
    '完成产值',
    '实际成本',
    '综合收益',
    '业主计价金额',
    '业主批复金额'
  ],
  rows: [
    {
      金额: '',
      合同: 150,
      目标成本: -100,
      50: '',
      完成产值: 140,
      实际成本: -90,
      综合收益: 50,
      业主计价金额: 140,
      业主批复金额: 100
    }
  ]
}

export const monthDetailData = {
  // columns: [
  //   '金额', '合同', '目标成本'
  // ],
  columns: [
    '金额',
    '合同',
    '目标成本',
    '预计收益',
    '完成产值',
    '实际成本',
    '综合收益',
    '业主计价金额',
    '业主批复金额'
  ],
  rows: [
    {
      金额: '劳务',
      合同: 20,
      目标成本: -25,
      预计收益: -5,
      完成产值: 15,
      实际成本: -20,
      综合收益: -5,
      业主计价金额: 15,
      业主批复金额: 15
    },
    {
      金额: '材料',
      合同: 80,
      目标成本: -50,
      预计收益: 30,
      完成产值: 75,
      实际成本: -45,
      综合收益: 30,
      业主计价金额: 75,
      业主批复金额: 60
    },
    {
      金额: '机械',
      合同: 14,
      目标成本: -8,
      预计收益: 6,
      完成产值: 14,
      实际成本: -8,
      综合收益: 6,
      业主计价金额: 14,
      业主批复金额: 8
    },
    {
      金额: '专业分包',
      合同: 150,
      目标成本: -100,
      预计收益: 50,
      完成产值: 140,
      实际成本: -90,
      综合收益: 50,
      业主计价金额: 140,
      业主批复金额: 100
    },
    {
      金额: '现场经费',
      合同: 15,
      目标成本: -7,
      预计收益: 8,
      完成产值: 15,
      实际成本: -7,
      综合收益: 8,
      业主计价金额: 15,
      业主批复金额: 7
    },
    {
      金额: '其他费用',
      合同: 150,
      目标成本: -100,
      预计收益: 50,
      完成产值: 140,
      实际成本: -90,
      综合收益: 50,
      业主计价金额: 140,
      业主批复金额: 100
    }
  ]
}
