export const monthChartData = {
  // columns: [
  //   '金额', '合同', '目标成本'
  // ],
  columns: [
    '金额',
    '合同',
    '目标成本',
    '预计收益',
    '完成产值',
    '实际成本',
    '综合收益',
    '业主计价金额',
    '业主批复金额'
  ],
  rows: [
    {
      金额: '',
      合同: 150,
      目标成本: -100,
      50: '',
      完成产值: 140,
      实际成本: -90,
      综合收益: 50,
      业主计价金额: 140,
      业主批复金额: 100
    }
  ]
}
export const yearChartData = {
  // columns: [
  //   '金额', '合同', '目标成本'
  // ],
  columns: [
    '金额',
    '合同',
    '目标成本',
    '预计收益',
    '完成产值',
    '实际成本',
    '综合收益',
    '业主计价金额',
    '业主批复金额'
  ],
  rows: [
    {
      金额: '',
      合同: 250,
      目标成本: -200,
      50: '',
      完成产值: 300,
      实际成本: -310,
      综合收益: -10,
      业主计价金额: 300,
      业主批复金额: 250
    }
  ]
}
export const overChartData = {
  // columns: [
  //   '金额', '合同', '目标成本'
  // ],
  columns: [
    '金额',
    '合同',
    '目标成本',
    '预计收益',
    '完成产值',
    '实际成本',
    '综合收益',
    '业主计价金额',
    '业主批复金额'
  ],
  rows: [
    {
      金额: '',
      合同: 150,
      目标成本: -100,
      50: '',
      完成产值: 140,
      实际成本: -90,
      综合收益: 50,
      业主计价金额: 140,
      业主批复金额: 100
    }
  ]
}

export const monthDetailData = {
  // columns: [
  //   '金额', '合同', '目标成本'
  // ],
  columns: [
    '金额',
    '合同',
    '目标成本',
    '预计收益',
    '完成产值',
    '实际成本',
    '综合收益',
    '业主计价金额',
    '业主批复金额'
  ],
  rows: [
    {
      金额: '劳务',
      合同: 20,
      目标成本: -100,
      50: '',
      完成产值: 140,
      实际成本: -90,
      综合收益: 50,
      业主计价金额: 140,
      业主批复金额: 100
    },
    {
      金额: '',
      合同: 150,
      目标成本: -100,
      50: '',
      完成产值: 140,
      实际成本: -90,
      综合收益: 50,
      业主计价金额: 140,
      业主批复金额: 100
    },
    {
      金额: '',
      合同: 150,
      目标成本: -100,
      50: '',
      完成产值: 140,
      实际成本: -90,
      综合收益: 50,
      业主计价金额: 140,
      业主批复金额: 100
    },
    {
      金额: '',
      合同: 150,
      目标成本: -100,
      50: '',
      完成产值: 140,
      实际成本: -90,
      综合收益: 50,
      业主计价金额: 140,
      业主批复金额: 100
    },
    {
      金额: '',
      合同: 150,
      目标成本: -100,
      50: '',
      完成产值: 140,
      实际成本: -90,
      综合收益: 50,
      业主计价金额: 140,
      业主批复金额: 100
    },
    {
      金额: '',
      合同: 150,
      目标成本: -100,
      50: '',
      完成产值: 140,
      实际成本: -90,
      综合收益: 50,
      业主计价金额: 140,
      业主批复金额: 100
    }
  ]
}
